# ข้อที่ 1 ร้านกาแฟในท้องถิ่นจะติดตามปริมาณกาแฟที่ขายเทียบกับอุณหภูมิ
# ข้อมูล Temperature และ Coffee Sales
# Temperature 12.8, 15.1, 10.4, 13.5, 16.7, 20.3, 18.6, 24.0, 21.8, 17.3, 19.7, 14.9
# Coffee Sales 185, 275, 150, 290, 370, 500, 390, 570, 520, 410, 435, 390
# จงหา 
# - คำนวณค่าเฉลี่ยของแต่ละชุดข้อมูล 
# - คำนวณสัมประสิทธิ์สหสัมพันธ์
# - สร้าง Scatter Plot
# - อธิบายความสัมพันธ์


# """
# ข้อที่ 2 บริษัทอสังหาริมทรัพย์ต้องการตรวจสอบว่ามีความสัมพันธ์ระหว่างพื้นที่ของบ้าน (ตร.ม.) กับราคาขายหรือไม่
# ข้อมูล พื้นที่ของบ้าน (ตร.ม.) และ ราคาขาย (ล้านบาท)
# พื้นที่ของบ้าน (ตร.ม.) 60, 120, 200, 80, 150, 100
# ราคาขาย (ล้านบาท) 2.5, 4.8, 9.0, 3.2, 6.5, 4.0
# จงหา 
# - คำนวณค่าเฉลี่ยของแต่ละชุดข้อมูล 
# - คำนวณสัมประสิทธิ์สหสัมพันธ์
# - สร้าง Scatter Plot
# - อธิบายความสัมพันธ์
# """

# """
# ข้อ 3 วิเคราะห์ความสัมพันธ์ระหว่างจำนวนวันแดดจัดแต่ละเดือนกับยอดขายเครื่องดื่มเย็น (Cold Beverages)
# ข้อมูลจากไฟล์ sunny_days_sales.csv
# จงหา 
# - คำนวณค่าเฉลี่ยของแต่ละชุดข้อมูล 
# - คำนวณสัมประสิทธิ์สหสัมพันธ์
# - สร้าง Scatter Plot
# - อธิบายความสัมพันธ์
# """

# """
# ข้อ 4 วิเคราะห์ความสัมพันธ์ระหว่าง"จำนวนครั้งที่ใช้งาน" (Usage_Count) และ "ค่าซ่อมบำรุงรายปี" 
# (Annual_Maintenance_Cost) ของอุปกรณ์อิเล็กทรอนิกส์
# ข้อมูลจากไฟล์ maintenance_data.csv
# จงหา 
# - คำนวณค่าเฉลี่ยของแต่ละชุดข้อมูล 
# - คำนวณสัมประสิทธิ์สหสัมพันธ์
# - สร้าง Scatter Plot
# - อธิบายความสัมพันธ์
# """